In [1]:
import numpy as np 
import pandas as pd

In [2]:
data={
    "name":['anshu','aman ','junu','anna'],
    "age":[34,23,34,34], 
    "address":["dharan","ktm","ktm",'ktm'],
    "Salary_in_thousands":[23,34323,34534,34534]
}
labels=['1','2','3','4']

In [3]:
df=pd.DataFrame(data,index=labels)

In [4]:
siblings =[
    ['anhsu','dharan',22,1000],
    ['aman','ktm',3500]
]

In [5]:
df2=pd.DataFrame(siblings)

In [6]:
df2

       0       1     2       3
0  anhsu  dharan    22  1000.0
1   aman     ktm  3500     NaN

In [7]:
cl=['name','Address','age','Salary NRP']

In [8]:
df2=pd.DataFrame(siblings,columns=cl)

In [9]:
df2

    name Address   age  Salary NRP
0  anhsu  dharan    22      1000.0
1   aman     ktm  3500         NaN

In [10]:
df

    name  age address  Salary_in_thousands
1  anshu   34  dharan                   23
2  aman    23     ktm                34323
3   junu   34     ktm                34534
4   anna   34     ktm                34534

# selecting a columns

In [11]:
df['Salary_in_thousands']

1       23
2    34323
3    34534
4    34534
Name: Salary_in_thousands, dtype: int64

# for the two or more columns selection

In [12]:
df[['name','address']] # list inside the list for the two columns selections

    name address
1  anshu  dharan
2  aman      ktm
3   junu     ktm
4   anna     ktm

# creating of columns

In [13]:
df['experince']=[3,4,6,7]

In [14]:
df

    name  age address  Salary_in_thousands  experince
1  anshu   34  dharan                   23          3
2  aman    23     ktm                34323          4
3   junu   34     ktm                34534          6
4   anna   34     ktm                34534          7

# removing a columns

In [15]:
df.drop(columns=['age','name'],inplace=False)

  address  Salary_in_thousands  experince
1  dharan                   23          3
2     ktm                34323          4
3     ktm                34534          6
4     ktm                34534          7

In [16]:
df

    name  age address  Salary_in_thousands  experince
1  anshu   34  dharan                   23          3
2  aman    23     ktm                34323          4
3   junu   34     ktm                34534          6
4   anna   34     ktm                34534          7

In [17]:
df.drop('1',axis=0)

    name  age address  Salary_in_thousands  experince
2  aman    23     ktm                34323          4
3   junu   34     ktm                34534          6
4   anna   34     ktm                34534          7

# selecting a row

In [18]:
df

    name  age address  Salary_in_thousands  experince
1  anshu   34  dharan                   23          3
2  aman    23     ktm                34323          4
3   junu   34     ktm                34534          6
4   anna   34     ktm                34534          7

In [19]:
df.loc[['1','2']]

    name  age address  Salary_in_thousands  experince
1  anshu   34  dharan                   23          3
2  aman    23     ktm                34323          4

In [20]:
df.iloc[1]

name                   aman
age                       23
address                  ktm
Salary_in_thousands    34323
experince                  4
Name: 2, dtype: object

# selecting the subject of series await

In [21]:
df

    name  age address  Salary_in_thousands  experince
1  anshu   34  dharan                   23          3
2  aman    23     ktm                34323          4
3   junu   34     ktm                34534          6
4   anna   34     ktm                34534          7

In [22]:
df.iloc[[0,1]][['address','experince']]

  address  experince
1  dharan          3
2     ktm          4

In [23]:
df.loc[['3','4']][['name','age','Salary_in_thousands']]

   name  age  Salary_in_thousands
3  junu   34                34534
4  anna   34                34534

# conditional selecting

In [24]:
df['age']=[22,25,25,28]
df

    name  age address  Salary_in_thousands  experince
1  anshu   22  dharan                   23          3
2  aman    25     ktm                34323          4
3   junu   25     ktm                34534          6
4   anna   28     ktm                34534          7

In [25]:
df[df['age']>27]

   name  age address  Salary_in_thousands  experince
4  anna   28     ktm                34534          7

In [31]:
df[(df['age']>26) & (df["address"] =="ktm")] # for the erros use the parenthesis for the error fixing

   name  age address  Salary_in_thousands  experince
4  anna   28     ktm                34534          7